[
{"title": "CubeSmart Launches Fully Online Rental Capability", "date_published": "2020-04-28T20:15:00Z", "body_text": ["MALVERN, Pa., April  28, 2020  (GLOBE NEWSWIRE) -- Today, CubeSmart (NYSE: CUBE), the third-largest owner and operator of self-storage properties in the United States, introduces SmartRental™, its proprietary fully online rental option. Utilizing SmartRental, customers have the ability to complete the entire rental experience online – from reservation through to move-in. SmartRental expands upon CubeSmart’s existing contactless rental options by giving customers an entirely digital choice.", "“Our goal is to make our customers’ lives easier and provide them with choices to meet their varied needs,” said Christopher P.  Marr, President and Chief Executive Officer of CubeSmart. “SmartRental is our newest way of enhancing the customer experience by providing another service option to engage with our customers however they choose to engage with us.”", "With SmartRental, CubeSmart provides an offering for customers who prefer to control the entire rental transaction themselves. Now, from any web-enabled device (desktop, tablet, or mobile), customers can reserve their unit, sign a lease, pay, and move right in. The entire rental process can be completed in less than five minutes.", "Through the SmartRental contactless rental process, customers won’t need to interact with CubeSmart teammates; however, our teammates will be working behind-the-scenes to ensure the customer experience is as seamless as possible and will continue to be available to provide assistance if needed.", "About CubeSmart", "CubeSmart is a self-administered and self-managed real estate investment trust. CubeSmart owns or manages 1,237 self-storage properties across the United States. According to the 2020 Self Storage Almanac, CubeSmart is one of the top three owners and operators of self-storage properties in the U.S.", "The Company’s mission is to simplify the organizational and logistical challenges created by the many life events and business needs of its customers – through innovative solutions, unparalleled service, and genuine care. The Company's self-storage properties are designed to offer affordable, easily accessible, and, in most locations, climate-controlled storage space for residential and commercial customers.", "For more information about business and personal storage or to learn more about the Company and find a nearby storage property, visit www.cubesmart.com or call CubeSmart toll free at 800-800-1717.", "Company Contact", ":", "Tim Martin", "Chief Financial Officer", "(610) 535-5700"], "tickers": ["CUBE"]},
{"title": "Health Catalyst to Announce First Quarter 2020 Operating Results and Host Conference Call on Tuesday, May 12, 2020", "date_published": "2020-04-28T20:15:00Z", "body_text": ["SALT LAKE CITY, April  28, 2020  (GLOBE NEWSWIRE) -- Health Catalyst, Inc. (\"Health Catalyst\", Nasdaq: HCAT), a leading provider of data and analytics technology and services to healthcare organizations, will release its 2020 first quarter operating results on Tuesday, May 12, 2020, after market close. In conjunction, the company will host a conference call to review the results at 5 p.m. E.T. on the same day.", "Conference Call Details", "The conference call can be accessed by dialing 1-877-295-1104 for U.S. participants, or 1-470-495-9486 for international participants, and referencing participant code 8292058. A live audio webcast will be available online at ", "https://ir.healthcatalyst.com/", ". A replay of the call will be available via webcast for on-demand listening shortly after the completion of the call, at the same web link, and will remain available for approximately 90 days.", "About Health Catalyst", "Health Catalyst is a leading provider of data and analytics technology and services to healthcare organizations committed to being the catalyst for massive, measurable, data-informed healthcare improvement. Its customers leverage the cloud-based data platform—powered by data from more than 100 million patient records and encompassing trillions of facts—as well as its analytics software and professional services expertise to make data-informed decisions and realize measurable clinical, financial and operational improvements. Health Catalyst envisions a future in which all healthcare decisions are data informed.", "Health Catalyst Investor Relations Contact:", "Adam Brown", " Senior Vice President, Investor Relations", " +1 (855)-309-6800", " ", "ir@healthcatalyst.com", "Health Catalyst Media Contact:", "Kristen Berry", " Vice President, Public Relations", " +1 (617) 234-4123", " +1 (774) 573-0455 (m)", " ", "kberry@we-worldwide.com"], "tickers": ["HCAT"]},
{"title": "Highwoods Announces Availability of First Quarter 2020 Results", "date_published": "2020-04-28T20:20:00Z", "body_text": ["RALEIGH, N.C., April  28, 2020  (GLOBE NEWSWIRE) -- ", "Highwoods Properties, Inc. (NYSE:", "HIW", ")", " has released its first quarter 2020 results.  Please visit the investors section of our website at ", "www.highwoods.com", " to view the release, or click on the following link.", "HIW Reports First Quarter 2020 Results", "About Highwoods ", "Highwoods Properties, Inc., headquartered in Raleigh, is a publicly-traded (NYSE:", "HIW", ") real estate investment trust (“REIT”) and a member of the S&P MidCap 400 Index.  Highwoods is a fully-integrated office REIT that owns, develops, acquires, leases and manages properties primarily in the best business districts (BBDs) of Atlanta, Charlotte, Nashville, Orlando, Pittsburgh, Raleigh, Richmond and Tampa.  For more information about Highwoods, please visit our website at ", "www.highwoods.com", ".", " "], "tickers": []},
{"title": "Juniper Networks Reports Preliminary First Quarter 2020 Financial Results", "date_published": "2020-04-28T20:15:00Z", "body_text": ["SUNNYVALE, Calif., April  28, 2020  (GLOBE NEWSWIRE) -- Juniper Networks (NYSE: JNPR), a leader in secure, AI-driven networks, today reported preliminary financial results for the three months ended March 31, 2020 and provided its outlook for the three months ending June 30, 2020.", "First Quarter 2020 Financial Performance", "Net revenues were $998.0 million, flat year-over-year, and a decrease of 17% sequentially.", "GAAP operating margin was 3.9%, a decrease from 4.3% in the first quarter of 2019, and a decrease from 14.8% in the fourth quarter of 2019.", "Non-GAAP operating margin was 10.6%, a decrease from 11.2% in the first quarter of 2019, and a decrease from 20.3% in the fourth quarter of 2019.", "GAAP net income was $20.4 million, a decrease of 34% year-over-year, and a decrease of 88% sequentially, resulting in diluted earnings per share of $0.06.", "Non-GAAP net income was $77.2 million, a decrease of 17% year-over-year, and a decrease of 61% sequentially, resulting in non-GAAP diluted earnings per share of $0.23.", "\"Orders grew 10% on a year-over-year basis during the March quarter and improved across each of our core industry verticals. With our stronger than expected demand, we believe our financial results would have exceeded the mid-point of our guidance if not for supply challenges we faced resulting from the COVID-19 pandemic,\" said Juniper's CEO, Rami Rahim. “While we are starting to see some weakness in our enterprise pipeline, which is impacting visibility into the second half of the year, we believe the overall momentum we are seeing speaks to the strength of our solutions, our strong customer relationships and the efforts we undertook to diversify the business across verticals and customers over the past several years.”", "“We are executing well despite the significant challenges created by the COVID-19 pandemic,” said Juniper’s CFO, Ken Miller. “We are making progress ramping our supply chain back to full productivity and continue to effectively manage costs while positioning the business for future growth. Our balance sheet remains strong and we continue to generate cash, which we expect will position us to not only weather the current crisis, but also to come out stronger on the other side.”", "Balance Sheet and Other Financial Results", "Total cash, cash equivalents, and investments as of March 31, 2020 were $2,529.9 million, compared to $3,502.7 million as of March 31, 2019, and $2,543.6 million as of December 31, 2019.", "Net cash flows provided by operations for the first quarter of 2020 was $272.2 million, compared to $159.4 million in the first quarter of 2019, and $95.7 million in the fourth quarter of 2019.", "Days sales outstanding in accounts receivable was 61 days in the first quarter of 2020, compared to 58 days in the first quarter of 2019, and 66 days in the fourth quarter of 2019.", "Capital expenditures were $21.8 million, and depreciation and amortization expense was $53.7 million during the first quarter of 2020.", "Outlook", "These metrics are provided on a non-GAAP basis, except for revenue and share count. Non-GAAP earnings per share is on a fully diluted basis. The outlook assumes that the exchange rate of the U.S. dollar to other currencies will remain relatively stable at current levels.", "While we are seeing uncertainty in our business due to the COVID-19 pandemic, we expect to see sequential revenue and non-GAAP earnings growth in Q2. Confidence in our forecast is driven by strong backlog and healthy momentum with our Service Provider and Cloud customers. We believe these factors should help offset increased uncertainty in certain segments of the Enterprise market. Due to the uncertain macroenvironment we have widened our revenue range for the second quarter.", "We expect non-GAAP gross margin to be essentially flat sequentially relative to Q1. We expect to see sequential volume driven improvements in margin during the June quarter to be offset by certain strategic insertion opportunities in addition to increased logistics and other supply chain-related costs due to the COVID-19 pandemic.", "We expect second quarter non-GAAP operating expense to decline sequentially as we continue to focus on prudent cost management while continuing to invest to capture future opportunities.", "Our Board of Directors has declared a cash dividend of $0.20 per share to be paid on June 22, 2020 to shareholders of record as of the close of business on June 1, 2020. We remain committed to paying our dividend. While we expect to remain opportunistic with respect to share buybacks, we expect to place a greater emphasis on further building liquidity in this uncertain environment.", "Our guidance for the quarter ending June 30, 2020 is as follows:", "All forward-looking non-GAAP measures exclude estimates for amortization of intangible assets, share-based compensation expenses, acquisition and strategic investment related charges, restructuring benefits or charges, impairment charges, strategic partnership-related charges, legal reserve and settlement charges or benefits, gain or loss on equity investments, loss on extinguishment of debt, retroactive impact of certain tax settlements, significant effects of tax legislation and judicial or administrative interpretation of tax regulations, including the impact of income tax reform, non-recurring income tax adjustments, valuation allowance on deferred tax assets, and the income tax effect of non-GAAP exclusions, and do not include the impact of further changes to previously announced tariffs and the impact of any future acquisitions, divestitures, or joint ventures that may occur in the period. Juniper is unable to provide a reconciliation of non-GAAP guidance measures to corresponding U.S. generally accepted accounting principles or GAAP measures on a forward-looking basis without unreasonable effort due to the overall high variability and low visibility of most of the foregoing items that have been excluded. For example, share-based compensation expense is impacted by the Company’s future hiring needs, the type and volume of equity awards necessary for such future hiring, and the price at which the Company’s stock will trade in those future periods. Amortization of intangible assets is significantly impacted by the timing and size of any future acquisitions. The items that are being excluded are difficult to predict and a reconciliation could result in disclosure that would be imprecise or potentially misleading. Material changes to any one of these items could have a significant effect on our guidance and future GAAP results. Certain exclusions, such as amortization of intangible assets and share-based compensation expenses, are generally incurred each quarter, but the amounts have historically and may continue to vary significantly from quarter to quarter.", "Withdrawal of Full-Year Commentary", "While we are optimistic regarding our long-term prospects and opportunity to gain share across each of our customer verticals, we are withdrawing our previously announced full-year 2020 commentary because we cannot predict the specific extent or duration of the impact of the COVID-19 outbreak on our financial results.", "First Quarter 2020 Financial Commentary Available Online", "A CFO Commentary reviewing the Company’s first quarter 2020 financial results, as well as the second quarter 2020 financial outlook will be furnished to the SEC on Form 8-K and published on the Company’s website at ", "http://investor.juniper.net", ". Analysts and investors are encouraged to review this commentary prior to participating in the conference call webcast.", "Conference Call Webcast", "Juniper Networks will host a conference call webcast today, April 28, 2020, at 2:00 pm PT, to be broadcast live over the Internet at ", "http://investor.juniper.net", ". To participate via telephone in the US, the toll-free number is 1-877-407-8033. Outside the US, dial +1-201-689-8033. Please call 10 minutes prior to the scheduled conference call time. The webcast replay will be archived on the Juniper Networks website.", "About Juniper Networks", "Juniper Networks challenges the inherent complexity that comes with networking in the multicloud era. We do this with products, solutions and services that transform the way people connect, work and live. We simplify the process of transitioning to a secure and automated multicloud environment to enable secure, AI-driven networks that connect the world. Additional information can be found at Juniper Networks (", "www.juniper.net", ").", "Investors and others should note that the Company announces material financial and operational information to its investors using its Investor Relations website, press releases, SEC filings and public conference calls and webcasts. The Company also intends to use the Twitter account @JuniperNetworks and the Company’s blogs as a means of disclosing information about the Company and for complying with its disclosure obligations under Regulation FD. The social media channels that the Company intends to use as a means of disclosing information described above may be updated from time to time as listed on the Company’s Investor Relations website.", "Juniper Networks, the Juniper Networks logo, Juniper, Junos, and other trademarks are registered trademarks of Juniper Networks, Inc. and/or its affiliates in the United States and other countries. Other names may be trademarks of their respective owners.", "Safe Harbor", "Statements in this release concerning Juniper Networks’ business, economic and market outlook, including currency exchange rates; our expectations regarding revenue, earnings and non-GAAP gross margin growth; and the expected impact of COVID-19 on these measures; our expectations regarding our liquidity and operating expenses; our financial guidance; and our overall future prospects are forward-looking statements within the meaning of the Private Securities Litigation Reform Act that involve a number of uncertainties and risks. Actual results or events could differ materially from those anticipated in those forward-looking statements as a result of several factors, including: the duration, extent and impact of the COVID-19 pandemic; general economic and political conditions globally or regionally; business and economic conditions in the networking industry; changes in overall technology spending by our customers, including Cloud providers and Service Providers; the network capacity requirements of our customers and, in particular, Cloud and telecommunication service providers; contractual terms that may result in the deferral of revenue; the timing of orders and their fulfillment; manufacturing and supply chain costs, constraints, changes or disruptions; availability and pricing of key product components; delays in scheduled product availability; adoption of regulations or standards affecting Juniper Networks products, services or the networking industry; product defects, returns or vulnerabilities; significant effects of tax legislation and judicial or administrative interpretation of tax regulations and judicial or administrative interpretation of tax regulations; legal settlements and resolutions; the potential impact of activities related to the execution of capital return, restructurings and product rationalization; the impact of import tariffs, depending on their scope and how they are implemented; and other factors listed in Juniper Networks’ most recent report on Form 10-Q or 10-K filed with the Securities and Exchange Commission. In addition, many of the foregoing risks and uncertainties are, and could be, exacerbated by the COVID-19 pandemic and any worsening of the global business and economic environment as a result. We cannot at this time predict the extent of the impact of the COVID-19 pandemic and any resulting business or economic impact, but it could have a material adverse effect on our business, financial condition, results of operations and cash flows. Note that our estimates as to tax rate on our business are based on current tax law and regulations, including current interpretations thereof, and could be materially affected by changing interpretations as well as additional legislation and guidance. All statements made in this press release are made only as of the date set forth at the beginning of this release. Juniper Networks undertakes no obligation to update the information made in this release in the event facts or circumstances subsequently change after the date of this press release. We have not filed our Form 10-Q for the quarter ended March 31, 2020. As a result, all financial results described in this earnings release should be considered preliminary, and are subject to change to reflect any necessary adjustments or changes in accounting estimates, that are identified prior to the time we file the Form 10-Q.", "Use of Non-GAAP Financial Information", "Juniper Networks believes that the presentation of non-GAAP financial information provides important supplemental information to management and investors regarding financial and business trends relating to the company’s financial condition and results of operations. For further information regarding why Juniper Networks believes that these non-GAAP measures provide useful information to investors, the specific manner in which management uses these measures, and some of the limitations associated with the use of these measures, please refer to the \"Discussion of Non-GAAP Financial Measures\" section of this press release. The following tables and reconciliations can also be found on our Investor Relations website at ", "http://investor.juniper.net", ".", " ", " ", "Discussion of Non-GAAP Financial Measures", "This press release, including the tables above, includes the following non-GAAP financial measures derived from our Preliminary Consolidated Statements of Operations: operating income; operating margin; net income; and diluted net income per share. These measures are not presented in accordance with, nor are they a substitute for GAAP. In addition, these measures may be different from non-GAAP measures used by other companies, limiting their usefulness for comparison purposes. The non-GAAP financial measures used in the table above should not be considered in isolation from measures of financial performance prepared in accordance with GAAP. Investors are cautioned that there are material limitations associated with the use of non-GAAP financial measures as an analytical tool. In particular, certain of the adjustments to our GAAP financial measures reflect the exclusion of items that are recurring and will be reflected in our financial results for the foreseeable future.", "We utilize a number of different financial measures, both GAAP and non-GAAP, in analyzing and assessing the overall performance of our business, in making operating decisions, forecasting and planning for future periods, and determining payments under compensation programs. We consider the use of the non-GAAP measures presented above to be helpful in assessing the performance of the continuing operation of our business. By continuing operation, we mean the ongoing revenue and expenses of the business, excluding certain items that render comparisons with prior periods or analysis of on-going operating trends more difficult, such as expenses not directly related to the actual cash costs of development, sale, delivery or support of our products and services, or expenses that are reflected in periods unrelated to when the actual amounts were incurred or paid. Consistent with this approach, we believe that disclosing non-GAAP financial measures to the readers of our financial statements provides such readers with useful supplemental data that, while not a substitute for financial measures prepared in accordance with GAAP, allows for greater transparency in the review of our financial and operational performance. In addition, we have historically reported non-GAAP results to the investment community and believe that continuing to provide non-GAAP measures provides investors with a tool for comparing results over time. In assessing the overall health of our business for the periods covered by the table above and, in particular, in evaluating the financial line items presented in the table above, we have excluded items in the following three general categories, each of which are described below: Acquisition and Strategic Investment Related Charges, Other Items, and Share-Based Compensation Related Items. We also provide additional detail below regarding the shares used to calculate our non-GAAP net income per share. Notes identified for line items in the table above correspond to the appropriate note description below. With respect to the items excluded from our forward-looking non-GAAP measures and reconciliation of such measures, please see the “Outlook” section above.", "Note A: Acquisition and Strategic Investment Related Charges", ". We exclude certain expense items resulting from acquisitions including amortization of purchased intangible assets associated with our acquisitions. The amortization of purchased intangible assets associated with our acquisitions results in our recording expenses in our GAAP financial statements that were already expensed by the acquired company before the acquisition and for which we have not expended cash. Moreover, had we internally developed the products acquired, the amortization of intangible assets, and the expenses of uncompleted research and development would have been expensed in prior periods. Accordingly, we analyze the performance of our operations in each period without regard to such expenses. In addition, acquisitions result in non-continuing operating expenses, which would not otherwise have been incurred by us in the normal course of our business operations. We believe that providing non-GAAP information for acquisition-related expense items in addition to the corresponding GAAP information allows the users of our financial statements to better review and understand the historic and current results of our continuing operations, and also facilitates comparisons to less acquisitive peer companies.", "Note B: Other Items", ". We exclude certain other items that are the result of either unique, infrequent or unplanned events, including the following, when applicable: (i) restructuring charges or benefits; (ii) strategic partnership-related charges (iii) legal reserve and settlement charges or benefits; (iv) gain or loss on equity investments; (v) significant effects of tax legislation and judicial or administrative interpretation of tax regulations, including the impact of income tax reform; (vi) recognition of previously unrecognized tax benefits that are non-recurring in nature; (vii) the income tax effect on our financial statements of excluding items related to our non-GAAP financial measures. It is difficult to estimate the amount or timing of these items in advance. Although these events are reflected in our GAAP financial statements, these transactions may limit the comparability of our on-going operations with prior and future periods. Restructuring benefits or charges result from events that arise from unforeseen circumstances, which often occur outside of the ordinary course of continuing operations. These expenses do not accurately reflect the underlying performance of our continuing business operations for the period in which they are incurred. We also exclude certain expenses incurred for the formation of a strategic partnership, as they are directly related to an event that is distinct and does not reflect current ongoing business operations. In the case of legal reserves and settlements, these gains or losses are recorded in the period in which the matter is concluded or resolved even though the subject matter of the underlying dispute may relate to multiple or different periods. As such, we believe that these expenses do not accurately reflect the underlying performance of our continuing operations for the period in which they are incurred. Additionally, we exclude previously unrecognized tax benefits that are non-recurring in nature which are recorded in the period in which applicable statutes of limitation lapse or upon the completion of tax review cycles as the tax matter may relate to multiple or different periods. Further, the impact of certain income tax reform, including the revaluation of our deferred tax assets and liabilities are unique events that occur in periods that are generally unrelated to the level of business activity to which such tax reform or legislation applies. We believe these tax events limit the comparability with prior periods and that these expenses or benefits do not accurately reflect the underlying performance of our continuing business operations for the period in which they are incurred. We also believe providing financial information with and without the income tax effect of excluding items related to our non-GAAP financial measures provide our management and users of the financial statements with better clarity regarding the on-going performance and future liquidity of our business. Because of these factors, we assess our operating performance with these amounts both included and excluded, and by providing this information, we believe the users of our financial statements are better able to understand the financial results of what we consider our continuing operations.", "Note C: Share-Based Compensation Related Items", ". We provide non-GAAP information relative to our expense for share-based compensation and related payroll tax. Due to the varying available valuation methodologies, subjective assumptions and the variety of award types, which affect the calculations of share-based compensation, we believe that the exclusion of share-based compensation and related payroll tax allows for more accurate comparisons of our operating results to our peer companies and is useful to investors to understand the impact of share-based compensation to our results of operations. Further, expense associated with granting share-based awards does not reflect any cash expenditures by the company as no cash is expended.", "Note D: Non-GAAP Net Income Per Share Items", ". We provide diluted non-GAAP net income per share. The diluted non-GAAP net income per share includes additional dilution from potential issuance of common stock, except when such issuances would be anti-dilutive.", "Investor Relations: ", "Jess Lubert ", "Juniper Networks ", "(408) 936-3734 ", "jlubert@juniper.net", "Media Relations:", "Leslie Moore", "Juniper Networks", "(408) 936-5767", "llmoore@juniper.net"], "tickers": ["JNPR"]},
{"title": "U.S. Rep. Rosa DeLauro, Former OSHA Official, BlueGreen Alliance Leaders Call on OSHA to Protect Workers on Workers’ Memorial Day", "date_published": "2020-04-28T20:18:58Z", "body_text": ["WASHINGTON, D.C., April  28, 2020  (GLOBE NEWSWIRE) -- U.S. Rep. Rosa DeLauro (D-CT) today joined leaders from the BlueGreen Alliance and former Assistant Secretary of Labor for the U.S. Occupational Safety and Health Administration (OSHA) David Michaels to honor workers who have died on the job this year—including those who lost their battle with Covid-19—and to call on OSHA to protect workers during the ongoing Covid-19 pandemic. ", "LISTEN TO THE AUDIO FROM THE EVENT.", " ", "“We are calling on OSHA and the Trump administration to address the most urgent threat facing working people today: the Covid-19 pandemic,” said, Rep. DeLauro, chair of the Labor, Health and Human Services, and Education Appropriations Subcommittee, which oversees funding for the Department of Labor, OSHA, and the Department of Health and Human Services. “To date, OSHA has not released enforceable emergency standards to protect workers from the virus; instead, it has offered only non-binding guidance. As states begin to seek to re-open the economy, OSHA must uphold its mission, making sure employers are taking the necessary steps to keep their employees safe from this pandemic.” ", "To date, OSHA has not released enforceable emergency standards—instead offering only guidance, nor has it developed any strategy for safety training or workplace inspections at a scale the crisis requires.", " ", " “In OSHA’s own words, a guidance is ‘advisory in nature’ and ‘not a standard or a regulation’ and that means that an employer who wants to ignore it can ignore it without consequence,” said BlueGreen Alliance Executive Director Jason Walsh. “OSHA is putting out guidance that is non-enforceable by design", ", ", "while workers are putting their lives on the line.”", "A recent media investigation uncovered more than 3,000 Covid-19 related employee complaints filed with OSHA since the beginning of the year. The complaints come from a wide variety of sectors and raise critical issues such as lack of access to personal protective equipment (PPE) and even hand sanitizer or soap, employees being forced to work in close contact with other workers—including those who appear sick— and other concerns.  ", "“We are grateful for those American workers risking their lives fighting to keep our nation healthy, fed, and to ensure we all have access to the vital resources we need. We owe it to them to fight for their safety,” said Sierra Club Executive Director Michael Brune. “This pandemic has shown the glaring holes in the laws and regulations that exist to protect workers in this country, and frankly, this administration has done nothing to actually protect workers.” ", "“Health care, food service, and so many other essential workers who are caring for Americans during this Covid pandemic are working without protection and getting sick. Over 52,000 Americans have already died from Covid-19, many are our colleagues, our relatives, our friends and our neighbors,” said American Federation of Teachers President Randi Weingarten. “We must force OSHA to do its job and adopt an enforceable emergency standard.” ", "The leaders called on Labor Secretary Eugene Scalia to immediately enact and enforce an emergency standard to protect frontline workers, who are disproportionately people of color, and to use existing authority to existing agency standards for personal protective equipment, sanitation, and hazardous substances, as well as their legally required obligation to provide a safe workplace. In addition, they said they support two measures in Congress introduced by Congressman Bobby Scott (D-VA)—H.R. 6139, the Covid-19 Health Care Worker Protection Act of 2020 and H.R. 6559, the Covid-19 Every Worker Protection Act of 2020—that would force the agency to address concerns around Covid-19.  ", "“Our union is pushing for a massive increase in appropriate PPE for all workers, more rapid and reliable coronavirus testing, and a system for reporting and tracking workplace infections, so that all workers can stay safe on the job,” said USW International Secretary-Treasurer John Shinn. “Most importantly, decisions concerning workplace safety during this pandemic must be based on sound science and worker involvement.”", " ", "“This crisis has underscored the value of a safe and healthy workforce.” said Michaels, who was the longest-serving administrator in OSHA history. “We see the vital importance of the previously invisible low wage workers who grow our crops, process our meat, and ensure food gets to our table. In this crisis, we now recognize our these are essential, indispensable workers—we have to ensure they are safe, not just for their sake, but for ours.”", "-30-", "The BlueGreen Alliance unites America’s largest labor unions and its most influential environmental organizations to solve today’s environmental challenges in ways that create and maintain quality jobs and build a stronger, fairer economy. Visit ", "https://www.bluegreenalliance.org", "."], "tickers": []},
{"title": "Alphatec to Report First Quarter 2020 Financial Results on May 11, 2020", "date_published": "2020-04-28T20:20:00Z", "body_text": ["CARLSBAD, Calif., April  28, 2020  (GLOBE NEWSWIRE) -- Alphatec Holdings, Inc. (Nasdaq: ATEC) (“ATEC” or the “Company”), a provider of innovative spine surgery solutions dedicated to revolutionizing the approach to spine surgery, announced today that it will release first quarter financial results on Monday, May 11, 2020, after the market close.", "The Company will present the results via a live webcast on Monday, May 11, 2020, at 1:30 p.m. PT / 4:30 p.m. ET. The live webcast will be accessible at: ", "https://edge.media-server.com/mmc/p/uak532ci", ".  An audiocast of the presentation will also be available domestically at (877) 556-5251 and internationally at (720) 545-0036. The conference ID number is 2684098.", "A replay of the webcast will remain available on ATEC’s corporate website at ", "www.atecspine.com", " until the Company releases second quarter financial results. In addition, a replay of the audiocast will be available until May 19, 2020. The replay dial-in numbers are (855) 859-2056 for domestic callers and (404) 537-3406 for international callers. Please use the replay conference ID number 2684098.", "About Alphatec Holdings, Inc.", "Alphatec Holdings, Inc. (“ATEC”), through its wholly-owned subsidiaries, Alphatec Spine, Inc. and SafeOp Surgical, Inc., is a medical device company dedicated to revolutionizing the approach to spine surgery through clinical distinction. ATEC architects and commercializes approach-based technology that integrates seamlessly with the SafeOp Neural InformatiX System to provide real-time, objective nerve information that can enhance the safety and reproducibility of spine surgery. Additional information can be found at ", "www.atecspine.com", ".", "Forward-Looking Statements", "Statements made during the investor events referenced herein may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 that involve risks and uncertainty. Such statements are based on management's current expectations and are subject to many risks and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These and other forward-looking statements are not guarantees of future results and are subject to risks, uncertainties, and assumptions that could cause actual results to differ materially from those expressed in any forward-looking statements. A list and description of such factors, risks and uncertainties can be found in the Company’s most recent annual report, and any subsequent quarterly and current reports, filed with the Securities and Exchange Commission. ATEC disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise unless required by law.", "Investor/Media Contact:", "Josh Berg", "Investor Relations ", "(760) 494-6790", "ir@atecspine.com", "Company Contact:", "Jeff Black", "Chief Financial Officer", "Alphatec Holdings, Inc. ", "ir@atecspine.com", " "], "tickers": ["ATEC"]},
{"title": "One Liberty Properties Provides Business Update", "date_published": "2020-04-28T20:23:49Z", "body_text": ["GREAT NECK, N.Y., April  28, 2020  (GLOBE NEWSWIRE) -- One Liberty Properties, Inc. (NYSE: OLP), today issued an update on its business in light of the ongoing COVID-19 pandemic. ", "Patrick J. Callan, Jr., President and Chief Executive Officer of One Liberty commented, “The global spread of the COVID-19 virus is affecting us all.  During these unprecedented times, One Liberty remains committed to the health and safety of our tenants and employees.  We continue to monitor events and take steps to mitigate the potential impact and risks to the Company.  While navigating through this period of uncertainty, we remain confident in the strength of our portfolio and our ability to weather the current volatile period.”", "Operations: ", "The following is a summary of the Company’s March 2020 and April 2020 consolidated cash base rent collections as of April 27, 2020:", "As of April 27, 2020, tenants accounting for an aggregate of approximately 40% of the 2020 cash base rent have requested rent relief because their operations have been impacted by the current virus-related shutdown.  One Liberty has completed or is in discussions with those tenants and, where warranted, expects to give current relief and seek lease modifications that will be favorable to both parties.", "  ", "One Liberty is working with its lenders at mortgaged properties where the tenant collections are insufficient to cover full debt service.  The Company is seeking temporary relief which has been received in several situations.", "Balance Sheet:", "The Company’s balance sheet remains well-positioned to weather the current period of uncertainty.  At April 27, 2020, the Company had $9.6 million of cash and cash equivalents (net of the credit facility’s required $3 million deposit maintenance balance). At April 27, 2020, the Company can borrow up to (i) $36.2 million for acquisitions and (ii) $20 million for renovation expenses, under its credit facility.  The Company has borrowed the $10 million available for operating expenses under that facility.   ", "The Company believes that it is well positioned to overcome this unprecedented challenge facing the country by virtue of its strong cash flow and balance sheet and  its transformation  to a portfolio with an increased emphasis on industrial properties.", "Forward Looking Statement:", "Certain information contained in this press release, together with other statements and information publicly disseminated by One Liberty Properties, Inc. is forward looking within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended. We intend such forward looking statements to be covered by the safe harbor provision for forward looking statements contained in the Private Securities Litigation Reform Act of 1995 and include this statement for the purpose of complying with these safe harbor provisions. Although these forward-looking statements are based on good faith beliefs, reasonable assumptions and the Company’s best judgment reflecting current information, you should not rely on forward-looking statements since they involve known and unknown risks, uncertainties and other factors which are, in some cases, beyond the Company’s control and which could materially affect the Company’s results of operations, financial condition, cash flows, performance or future achievements or events. Currently, one of the most significant factors, however, is the potential adverse effect of the current pandemic of the novel coronavirus, or COVID-19, on the financial condition, results of operations, cash flows and performance of the Company and its tenants, the real estate market and the global economy and financial markets. The extent to which COVID-19 impacts the Company and its tenants will depend on future developments, which are highly uncertain and cannot be predicted with confidence, including the scope, severity and duration of the pandemic, the actions taken to contain the pandemic or mitigate its impact, and the direct and indirect economic effects of the pandemic and containment measures, among others.  Information regarding other important factors that could cause actual outcomes or other events to differ materially from any such forward looking statements appear in the Company's Annual Report on Form 10-K for the year ended December 31, 2019 and in particular “Item 1A. Risk Factors” and “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations”, included therein.", "About One Liberty Properties:", "One Liberty ", "is a self-administered and self-managed real estate investment trust incorporated in Maryland in 1982. The Company acquires, owns and manages a geographically diversified portfolio consisting primarily of industrial, retail, restaurant, health and fitness, and theater properties. Many of these properties are subject to long term net leases under which the tenant is typically responsible for the property’s real estate taxes, insurance and ordinary maintenance and repairs.", "Contact: ", "One Liberty Properties ", "Investor Relations ", "Phone: (516) 466-3100 ", "www.onelibertyproperties.com"], "tickers": ["OLP"]},
{"title": "Global Genotyping Industry", "date_published": "2020-04-28T20:19:45Z", "body_text": ["New York, April  28, 2020  (GLOBE NEWSWIRE) -- Reportlinker.com announces the release of the report \"Global Genotyping Industry\" - ", "https://www.reportlinker.com/p05798664/?utm_source=GNW", " ", "4%. The shifting dynamics supporting this growth makes it critical for businesses in this space to keep abreast of the changing pulse of the market. Poised to reach over US$14.8 Billion by the year 2025, Polymerase Chain Reaction (PCR) will bring in healthy gains adding significant momentum to global growth. ", "- Representing the developed world, the United States will maintain a 23.2% growth momentum. Within Europe, which continues to remain an important element in the world economy, Germany will add over US$1 Billion to the region’s size and clout in the next 5 to 6 years. Over US$1.4 Billion worth of projected demand in the region will come from Rest of Europe markets. In Japan, Polymerase Chain Reaction (PCR) will reach a market size of US$1.2 Billion by the close of the analysis period. As the world’s second largest economy and the new game changer in global markets, China exhibits the potential to grow at 19.8% over the next couple of years and add approximately US$5.2 Billion in terms of addressable opportunity for the picking by aspiring businesses and their astute leaders. Presented in visually rich graphics are these and many more need-to-know quantitative data important in ensuring quality of strategy decisions, be it entry into new markets or allocation of resources within a portfolio. Several macroeconomic factors and internal market forces will shape growth and development of demand patterns in emerging countries in Asia-Pacific. All research viewpoints presented are based on validated engagements from influencers in the market, whose opinions supersede all other research methodologies. ", "- Competitors identified in this market include, among others,  ", " ", "Read the full report: ", "https://www.reportlinker.com/p05798664/?utm_source=GNW", " ", "I. INTRODUCTION, METHODOLOGY & REPORT SCOPE", "II. EXECUTIVE SUMMARY", "1. MARKET OVERVIEW", "Genotyping - A Prelude", "Increasing Incidence of Genetic Diseases Propels the Genotyping", "Assays Market", "Which Genotyping Techniques Can be Adopted???", "Global Competitor Market Shares", "Genotyping Competitor Market Share Scenario Worldwide (in %):", "2019 & 2025", "2. FOCUS ON SELECT PLAYERS", "3. MARKET TRENDS & DRIVERS", "SEQUENCING TECHNOLOGIES TAKE THE MAJOR MARKET SHARE", "Expanding Applications of DNA Sequencing Offer Significant", "Opportunities for the Genotyping Market", "Decline in DNA Sequencing Costs Boosts Market Expansion", "The Race for $100 Genome Gets Closer", "Rising Demand for Hybrid Capture-Based Next Generation Sequencing", "Use of Genotyping in Drug Development Drives Market Opportunities", "Growth in Adoption of Plant and Animal Sequencing in", "Agricultural Research", "A Peek into the Genome Sequencing Projects", "GENOTYPING REAGENTS DOMINATE THE MARKET BY PRODUCT TYPE", "4. GLOBAL MARKET PERSPECTIVE", "Table 1: Genotyping Global Market Estimates and Forecasts in", "US$ Million by Region/Country: 2018-2025", "Table 2: Genotyping Market Share Shift across Key Geographies", "Worldwide: 2019 VS 2025", "Table 3: Polymerase Chain Reaction (PCR) (Technology) World", "Market by Region/Country in US$ Million: 2018 to 2025", "Table 4: Polymerase Chain Reaction (PCR) (Technology) Market", "Share Breakdown of Worldwide Sales by Region/Country: 2019 VS", "2025", "Table 5: Sequencing (Technology) Potential Growth Markets", "Worldwide in US$ Million: 2018 to 2025", "Table 6: Sequencing (Technology) Market Sales Breakdown by", "Region/Country in Percentage: 2019 VS 2025", "Table 7: Microarray (Technology) Geographic Market Spread", "Worldwide in US$ Million: 2018 to 2025", "Table 8: Microarray (Technology) Market Share Distribution in", "Percentage by Region/Country: 2019 VS 2025", "Table 9: MALDI-TOF (Technology) World Market by Region/Country", "in US$ Million: 2018 to 2025", "Table 10: MALDI-TOF (Technology) Market Share Distribution in", "Percentage by Region/Country: 2019 VS 2025", "Table 11: Capillary Electrophoresis (Technology) World Market", "Estimates and Forecasts by Region/Country in US$ Million: 2018", "to 2025", "Table 12: Capillary Electrophoresis (Technology) Market Share", "Breakdown by Region/Country: 2019 VS 2025", "Table 13: Other Technologies (Technology) World Market", "Estimates and Forecasts in US$ Million by Region/Country: 2018", "to 2025", "Table 14: Other Technologies (Technology) Market Percentage", "Share Distribution by Region/Country: 2019 VS 2025", "Table 15: Reagents & Kits (Product) Market Opportunity Analysis", "Worldwide in US$ Million by Region/Country: 2018 to 2025", "Table 16: Reagents & Kits (Product) Market Share Distribution", "in Percentage by Region/Country: 2019 VS 2025", "Table 17: Genotyping Services (Product) World Market by", "Region/Country in US$ Million: 2018 to 2025", "Table 18: Genotyping Services (Product) Market Share Breakdown", "of Worldwide Sales by Region/Country: 2019 VS 2025", "Table 19: Instruments (Product) Potential Growth Markets", "Worldwide in US$ Million: 2018 to 2025", "Table 20: Instruments (Product) Market Sales Breakdown by", "Region/Country in Percentage: 2019 VS 2025", "Table 21: Bioinformatics (Product) Geographic Market Spread", "Worldwide in US$ Million: 2018 to 2025", "Table 22: Bioinformatics (Product) Market Share Distribution in", "Percentage by Region/Country: 2019 VS 2025", "III. MARKET ANALYSIS", "GEOGRAPHIC MARKET ANALYSIS", "UNITED STATES", "Market Facts & Figures", "US Genotyping Market Share (in %) by Company: 2019 & 2025", "Market Analytics", "Table 23: Genotyping Market in US$ Million in the United States", "by Technology: 2018-2025", "Table 24: United States Genotyping Market Share Breakdown by", "Technology: 2019 VS 2025", "Table 25: United States Genotyping Market Estimates and", "Projections in US$ Million by Product: 2018 to 2025", "Table 26: United States Genotyping Market Share Breakdown by", "Product: 2019 VS 2025", "CANADA", "Table 27: Genotyping Market Analysis in Canada in US$ Million", "by Technology: 2018-2025", "Table 28: Canadian Genotyping Market Share Breakdown by", "Technology: 2019 VS 2025", "Table 29: Canadian Genotyping Market Estimates and Forecasts in", "US$ Million by Product: 2018 to 2025", "Table 30: Genotyping Market in Canada: Percentage Share", "Breakdown of Sales by Product for 2019 and 2025", "JAPAN", "Table 31: Japanese Medium & Long-Term Outlook for Genotyping", "Market in US$ Million by Technology: 2018-2025", "Table 32: Japanese Genotyping Market Percentage Share", "Distribution by Technology: 2019 VS 2025", "Table 33: Japanese Market for Genotyping: Annual Sales", "Estimates and Projections in US$ Million by Product for the", "Period 2018-2025", "Table 34: Japanese Genotyping Market Share Analysis by Product:", "2019 VS 2025", "CHINA", "Table 35: Genotyping Market Estimates and Forecasts in China in", "US$ Million by Technology: 2018-2025", "Table 36: Genotyping Market in China: Percentage Share Analysis", "by Technology for 2019 and 2025", "Table 37: Chinese Genotyping Market Growth Prospects in US$", "Million by Product for the Period 2018-2025", "Table 38: Chinese Genotyping Market by Product: Percentage", "Breakdown of Sales for 2019 and 2025", "EUROPE", "Market Facts & Figures", "European Genotyping Market: Competitor Market Share Scenario (", "in %) for 2019 & 2025", "Market Analytics", "Table 39: European Genotyping Market Demand Scenario in US$", "Million by Region/Country: 2018-2025", "Table 40: European Genotyping Market Share Shift by", "Region/Country: 2019 VS 2025", "Table 41: European Genotyping Market Assessment in US$ Million", "by Technology: 2018-2025", "Table 42: Genotyping Market in Europe: Percentage Breakdown of", "Sales by Technology for 2019 and 2025", "Table 43: European Genotyping Market Estimates and Forecasts in", "US$ Million by Product: 2018-2025", "Table 44: European Genotyping Market Share Breakdown by", "Product: 2019 VS 2025", "FRANCE", "Table 45: French Genotyping Market Estimates and Projections in", "US$ Million by Technology: 2018-2025", "Table 46: French Genotyping Market Share Breakdown by", "Technology: 2019 VS 2025", "Table 47: Genotyping Market in France by Product: Estimates and", "Projections in US$ Million for the Period 2018-2025", "Table 48: French Genotyping Market Share Analysis by Product:", "2019 VS 2025", "GERMANY", "Table 49: German Genotyping Latent Demand Forecasts in US$", "Million by Technology: 2018-2025", "Table 50: German Genotyping Market Share Breakdown by", "Technology: 2019 VS 2025", "Table 51: Genotyping Market in Germany: Recent Past, Current", "and Future Analysis in US$ Million by Product for the Period", "2018-2025", "Table 52: German Genotyping Market Share Breakdown by Product:", "2019 VS 2025", "ITALY", "Table 53: Genotyping Market Estimates and Forecasts in Italy in", "US$ Million by Technology: 2018-2025", "Table 54: Genotyping Market in Italy: Percentage Share Analysis", "by Technology for 2019 and 2025", "Table 55: Italian Genotyping Market Growth Prospects in US$", "Million by Product for the Period 2018-2025", "Table 56: Italian Genotyping Market by Product: Percentage", "Breakdown of Sales for 2019 and 2025", "UNITED KINGDOM", "Table 57: United Kingdom Medium & Long-Term Outlook for", "Genotyping Market in US$ Million by Technology: 2018-2025", "Table 58: United Kingdom Genotyping Market Percentage Share", "Distribution by Technology: 2019 VS 2025", "Table 59: United Kingdom Market for Genotyping: Annual Sales", "Estimates and Projections in US$ Million by Product for the", "Period 2018-2025", "Table 60: United Kingdom Genotyping Market Share Analysis by", "Product: 2019 VS 2025", "REST OF EUROPE", "Table 61: Rest of Europe Genotyping Market Assessment in US$", "Million by Technology: 2018-2025", "Table 62: Genotyping Market in Rest of Europe: Percentage", "Breakdown of Sales by Technology for 2019 and 2025", "Table 63: Rest of Europe Genotyping Market Estimates and", "Forecasts in US$ Million by Product: 2018-2025", "Table 64: Rest of Europe Genotyping Market Share Breakdown by", "Product: 2019 VS 2025", "ASIA-PACIFIC", "Table 65: Asia-Pacific Genotyping Market Estimates and", "Projections in US$ Million by Technology: 2018-2025", "Table 66: Asia-Pacific Genotyping Market Share Breakdown by", "Technology: 2019 VS 2025", "Table 67: Genotyping Market in Asia-Pacific by Product:", "Estimates and Projections in US$ Million for the Period", "2018-2025", "Table 68: Asia-Pacific Genotyping Market Share Analysis by", "Product: 2019 VS 2025", "REST OF WORLD", "Table 69: Genotyping Market Analysis in Rest of World in US$", "Million by Technology: 2018-2025", "Table 70: Rest of World Genotyping Market Share Breakdown by", "Technology: 2019 VS 2025", "Table 71: Rest of World Genotyping Market Estimates and", "Forecasts in US$ Million by Product: 2018 to 2025", "Table 72: Genotyping Market in Rest of World: Percentage Share", "Breakdown of Sales by Product for 2019 and 2025", "IV. COMPETITION", "AFFYMETRIX, INC.", "AGILENT TECHNOLOGIES", "BECKMAN COULTER", "FLUIDIGM CORPORATION", "ILLUMINA", "LIFE TECHNOLOGIES CORPORATION", "QIAGEN NV", "ROCHE DIAGNOSTICS", "SEQUENOM", "V. CURATED RESEARCH", "Read the full report: ", "https://www.reportlinker.com/p05798664/?utm_source=GNW", "About ", "Reportlinker", "ReportLinker is an award-winning market research solution. Reportlinker finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.", "__________________________"], "tickers": []},
{"title": "Aerojet Rocketdyne Holdings, Inc. Reports 2020 First Quarter Results", "date_published": "2020-04-28T20:15:00Z", "body_text": ["EL SEGUNDO, Calif., April  28, 2020  (GLOBE NEWSWIRE) -- Aerojet Rocketdyne Holdings, Inc. (NYSE:", "AJRD", ") today reported results for the three months ended March 31, 2020.", "Financial Overview", "_________", "* The Company provides Non-GAAP measures as a supplement to financial results based on accounting principles generally accepted in the United States (“GAAP”). A reconciliation of the Non-GAAP measures to the most directly comparable GAAP measures is included at the end of the release.", "“The first quarter of 2020 brought unprecedented times for our country and the world with the outbreak of COVID-19. Our first priority is the safety and well-being of our employees and we implemented a number of safety protocols during the quarter, that are still in place, in an effort to keep our employees and their families safe and healthy,” said Eileen Drake, CEO and President of Aerojet Rocketdyne Holdings, Inc. “Throughout all of this, I am very proud of the Aerojet Rocketdyne team and their ability to stay focused and productive.”", "“Total backlog at March 31, 2020 was $5.2 billion, up 37% from $3.8 billion a year ago primarily driven by multi-year awards on THAAD and various Raytheon programs, mainly Standard Missile,” said Drake. “We anticipate $2.0 billion of that to convert to sales over the next 12 months. We ended the quarter with strong EBITDAP margins of 13.1%, on sales of $476.1 million. Sales were down 3% year over year driven by lower sales from the Commercial Crew Development program, the shipment of the final AJ-60 solid rocket motor that occurred in the first quarter of 2019 and headwinds from the canceled RKV program. While the full impacts of the COVID-19 pandemic on Aerojet Rocketdyne are not yet known, I am very pleased with how our employees have been flexible, maintained discipline and continue to deliver the products necessary to defend our nation and further space exploration.”", "First quarter of 2020 compared with first quarter of 2019", "The decrease in net sales was primarily due to a decline of $21.3 million in space program sales primarily driven by (i) lower sales in the Commercial Crew Development program and (ii) the final shipment of the AJ-60 solid rocket motor that occurred in the first quarter of 2019, partially offset by growth in the RS-25 program. The decline in net sales was partially offset by an increase of $5.7 million in defense program sales primarily driven by the Guided Multiple Launch Rocket System (“GMLRS”) and hypersonic booster programs, partially offset by declines in the Redesigned Exoatmospheric Kill Vehicle (“RKV”) program which was canceled in 2019.", "The decrease in net income was impacted by (i) 2020 cost growth on a portion of the Standard Missile program and the reserve release upon the final AJ-60 solid rocket motor delivery in 2019 and (ii) higher retirement benefits expense, partially offset by lower stock-based compensation. The Company had $1.9 million of favorable changes in contract estimates on net income in the current period compared with favorable changes of $9.7 million in the first quarter of 2019.", "Backlog", "As of March 31, 2020, the Company’s total remaining performance obligations, also referred to as backlog, totaled $5.2 billion. The Company expects to recognize approximately 38%, or $2.0 billion, of the remaining performance obligations as sales over the next twelve months, an additional 24% the following twelve months, and 38% thereafter. A summary of the Company’s backlog is as follows:", "Total backlog includes both funded backlog (unfilled orders for which funding is authorized, appropriated and contractually obligated by the customer) and unfunded backlog (firm orders for which funding has not been appropriated). Indefinite delivery and quantity contracts and unexercised options are not reported in total backlog. Backlog is subject to funding delays or program restructurings/cancellations which are beyond the Company’s control.", "COVID-19", "During the three months ended March 31, 2020, there was minimal impact to the Company’s financial results and operations as a result of the COVID-19 outbreak that began in late 2019, and was declared a pandemic by the World Health Organization on March 11, 2020. The safety and welfare of employees is a top priority, and in the quarter, a number of safety protocols were established. Selected and site-specific work and travel restrictions, in addition to other measures intended to reduce the spread of COVID-19, were introduced. Although the Company did not experience significant absenteeism or supply chain disruption, the extent to which the COVID-19 pandemic impacts the Company’s financial results and operations for 2020 and beyond will depend on future developments which are highly uncertain and cannot be predicted, including new information which may emerge concerning the severity of the pandemic and the actions being taken to contain and treat it, and other indirect effects that may come as a result of actions taken by governments, companies, and individuals in response to the pandemic and its economic impact.", "Forward-Looking Statements", "This release contains certain “forward-looking statements” within the meaning of the United States Private Securities Litigation Reform Act of 1995. Such statements in this release and in subsequent discussions with the Company’s management are based on management’s current expectations and are subject to risks, uncertainty and changes in circumstances, which could cause actual results, performance or achievements to differ materially from anticipated results, performance or achievements. All statements contained herein and in subsequent discussions with the Company’s management that are not clearly historical in nature are forward-looking and the words “anticipate,” “believe,” “expect,” “estimate,” “plan,” and similar expressions are generally intended to identify forward-looking statements. A variety of factors could cause actual results or outcomes to differ materially from those expected and expressed in the Company’s forward-looking statements. Important risk factors that could cause actual results or outcomes to differ from those expressed in the forward-looking statements include, but are not limited to, the following:", "About Aerojet Rocketdyne Holdings, Inc.", "Aerojet Rocketdyne Holdings, Inc., headquartered in El Segundo, California, is an innovative technology-based manufacturer of aerospace and defense products and systems, with a real estate segment that includes activities related to the entitlement, sale, and leasing of the Company’s excess real estate assets. More information can be obtained by visiting the Company’s websites at ", "www.rocket.com", " or ", "www.aerojetrocketdyne.com", ".", "Contact information:", "Investors: Kelly Anderson, investor relations 310.252.8155", "The Company evaluates its operating segments based on several factors, of which the primary financial measure is segment performance. Segment performance represents net sales less applicable costs, expenses and provisions for unusual items relating to the segment. Excluded from segment performance are: corporate income and expenses, interest expense, interest income, income taxes, and unusual items not related to the segment. The Company believes that segment performance provides information useful to investors in understanding its underlying operational performance.", "Use of Unaudited Non-GAAP Financial Measures", "Adjusted EBITDAP, Adjusted Net Income, and Adjusted EPS", "The Company provides the Non-GAAP financial measures of its performance called Adjusted EBITDAP, Adjusted Net Income, and Adjusted EPS. The Company uses these metrics to measure its operating and total Company performance. The Company believes that for management and investors to effectively compare core performance from period to period, the metrics should exclude items that are not indicative of, or are unrelated to, results from the ongoing business operations such as retirement benefits (pension and postretirement benefits), significant non-cash expenses, the impacts of financing decisions on earnings, and items incurred outside the ordinary, ongoing and customary course of business. Accordingly, the Company defines Adjusted EBITDAP as GAAP net income adjusted to exclude interest expense, interest income, income taxes, depreciation and amortization, retirement benefits net of amounts that are recoverable under the Company’s U.S. government contracts, and unusual items which the Company does not believe are reflective of such ordinary, ongoing and customary activities. Adjusted Net Income and Adjusted EPS exclude retirement benefits net of amounts that are recoverable under its U.S. government contracts and unusual items which the Company does not believe are reflective of such ordinary, ongoing and customary activities. Adjusted Net Income and Adjusted EPS do not represent, and should not be considered an alternative to, net income or diluted EPS as determined in accordance with GAAP.", "_________", "(1)   The income tax impact is calculated using the federal and state statutory rates in the corresponding period.", "Free Cash Flow", "The Company also provides the Non-GAAP financial measure of Free Cash Flow. Free Cash Flow is defined as cash flow from operating activities less capital expenditures. Free Cash Flow should not be considered in isolation, as a measure of residual cash flow available for discretionary purposes, or as an alternative to cash flows from operations presented in accordance with GAAP. The Company uses Free Cash Flow, both in presenting its results to stakeholders and the investment community, and in the Company’s internal evaluation and management of the business. Management believes that this financial measure is useful because it provides supplemental information to assist investors in viewing the business using the same tools that management uses to evaluate progress in achieving the Company’s goals. The following table summarizes Free Cash Flow:", "Because the Company’s method for calculating these Non-GAAP measures may differ from other companies’ methods, the Non-GAAP measures presented above may not be comparable to similarly titled measures reported by other companies. These measures are not recognized in accordance with GAAP, and the Company does not intend for this information to be considered in isolation or as a substitute for GAAP measures.", " "], "tickers": []},
{"title": "O-I Glass Reports First Quarter 2020 Results", "date_published": "2020-04-28T20:20:00Z", "body_text": [" PERRYSBURG, Ohio, April  28, 2020  (GLOBE NEWSWIRE) -- ", "FOR IMMEDIATE RELEASE", "O-I Glass, Inc. (NYSE: OI) today reported financial results for the first quarter ended March 31, 2020.", "“As described in our preliminary earnings release update, O-I’s first quarter performance was solid. Results benefited from favorable price and mix as well as good cost performance. At the same time, shipment levels were slightly below prior year reflecting the initial impact of the COVID-19 pandemic and the volume pressures have continued in April. Consistent with our focus on cash generation, cash flows compared favorably to the same period in the prior year and liquidity was strong at the end of the first quarter,” said Andres Lopez, CEO.", "“We are pleased with the improvement in our operating performance given progress on our turnaround initiatives that benefited both the top and bottom line. I am confident these improvements will be sustained. To mitigate the impact of COVID-19, we are taking preemptive measures to reduce costs and improve cash generation including suspension of the company’s dividend. At the same time, we remain focused on creating long-term value by executing on our turnaround initiatives and advancing MAGMA,” concluded Lopez.  ", "Comments", "First Quarter 2020 Results", "First quarter 2020 net sales were $1.56 billion compared with $1.64 billion in the prior year. Higher selling prices increased revenue $19 million. However, lower shipments negatively impacted sales by $20 million as sales volume in tons declined 0.8 percent. Sales volumes reflected the net effect of a 1.7 percent decline due to COVID-19, a 1.1 percent decline in organic sales volumes and a 2.0 percent benefit from Nueva Fanal. Unfavorable foreign currency translation reduced net sales by $75 million compared to 2019. ", "Segment operating profit", "1", " was $169 million in the first quarter of 2020, compared with $200 million in the prior year period.  Profits were unfavorably impacted by $13 million attributable to unfavorable foreign currency translation and $15 million due to temporary items that benefited 2019 but did not repeat in 2020.", "Retained corporate and other costs were $21 million in the first quarter of 2020 compared with $24 million in the prior year period.  Net interest expense was $53 million in 2020, down from $65 million in 2019 due to recent refinancing activities. The company’s effective tax rate was 32.1 percent compared to 24.3 percent in the prior year. Excluding certain items that management does not consider representative of ongoing operations, the effective tax rate was 27.6 percent, which was higher than 24.5 percent in the prior year primarily reflecting shifts in regional earnings mix as well as recent regulatory changes in certain markets.  ", "During the first quarter of 2020, the company de-consolidated its direct, wholly owned subsidiary Paddock Enterprises LLC (“Paddock”) as of January 6, 2020, the day Paddock filed for Chapter 11 relief. As a result of the de-consolidation, O-I recorded a $14 million pre-tax charge which is excluded from adjusted earnings. ", "   ", "Cash utilized in operating activities was $315 million in the first quarter of 2020 and $595 million in the prior year period. Free cash flow was a $435 million use of cash in 2020 and $716 million in 2019. Favorable cash utilized in operating activities and free cash flow compared to the prior year included the benefit of lower working capital levels primarily due to increased utilization of accounts receivable factoring programs and the staying of all asbestos related payments as a result of Paddock filing for bankruptcy in early January.        ", "Total debt was $6.4 billion at March 31, 2020 compared to $5.9 billion at March 31, 2019. Net debt", "2", " was $5.5 billion compared to $5.6 billion in the prior year. At the end of the first quarter, O-I maintained approximately $1.7 billion in total committed liquidity including nearly $900 million cash-on-hand as well as undrawn availability on committed lines of credit.  In March, the company borrowed approximately $600 million on its $1.5 billion revolving credit facility to bolster cash-on-hand as a proactive measure to ensure financial flexibility.   ", "The company is actively monitoring the impact of the COVID-19 outbreak, which will negatively impact its business and results of operations for the second quarter of 2020 and likely beyond.  The extent to which the company’s operations will be impacted by the outbreak will depend largely on future developments, which are highly uncertain and cannot be accurately predicted, including new information which may emerge concerning the severity of the outbreak and actions by government authorities to contain the outbreak or treat its impact, among other things.", "Conference Call Scheduled for April 29, 2020", " ", "O-I Glass CEO Andres Lopez and CFO John Haudrich will conduct a conference call to discuss the company’s latest results on Wednesday, April 29, 2020, at 8:00 a.m. EDT.  A live webcast of the conference call, including presentation materials, will be available on the O-I website, ", "www.o-i.com/investors", ", in the Webcasts and Presentations section.", "The conference call also may be accessed by dialing 888-733-1701 (U.S. and Canada) or 706-634-4943 (international) by 7:50 a.m. EDT, on April 29, 2020.  Ask for the O-I conference call. A replay of the call will be available on the O-I website, ", "www.o-i.com/investors", ", for a year following the call.", "Contact: Sasha Sekpeh, 567-336-5128 – O-I Investor Relations", "O-I news releases are available on the O-I website at ", "www.o-i.com", ".", "O-I’s second quarter 2020 earnings conference call is currently scheduled for Wednesday, August 5, 2020, at 8:00 a.m. EDT.", "About O-I Glass ", "At O-I Glass, Inc. (NYSE: OI), we love glass and we’re proud to make more of it than any other glass bottle or jar producer in the world. We love that it’s beautiful, pure and completely recyclable. With global headquarters in Perrysburg, Ohio, we are the preferred partner for many of the world's leading food and beverage brands. Working hand and hand with our customers, we give our passion and expertise to make their bottles iconic and help build their brands around the world. With more than 27,500 people at 78 plants in 23 countries, O-I has a global impact, achieving revenues of $6.7 billion in 2019. For more information, visit o-i.com.", "Non-GAAP Financial Measures ", "The company uses certain non-GAAP financial measures, which are measures of its historical or future financial performance that are not calculated and presented in accordance with GAAP, within the meaning of applicable SEC rules.  Management believes that its presentation and use of certain non-GAAP financial measures, including adjusted earnings, adjusted earnings per share, segment operating profit,  net debt, and free cash flow, provide relevant and useful supplemental financial information, which is widely used by analysts and investors, as well as by management in assessing both consolidated and business unit performance.  These non-GAAP measures are reconciled to the most directly comparable GAAP measures and should be considered supplemental in nature and should not be considered in isolation or be construed as being more important than comparable GAAP measures.", "Adjusted earnings relates to net earnings from continuing operations attributable to the company, exclusive of items management considers not representative of ongoing operations because such items are not reflective of the company’s principal business activity, which is glass container production.  Adjusted earnings are divided by weighted average shares outstanding (diluted) to derive adjusted earnings per share.  Segment operating profit relates to earnings from continuing operations before interest expense (net), and before income taxes and is also exclusive of items management considers not representative of ongoing operations as well as certain retained corporate cost.  Net Debt is defined as gross debt less cash.  Management uses adjusted earnings, adjusted earnings per share, segment operating profit, segment operating profit margin and net debt to evaluate its period-over-period operating performance because it believes this provides a useful supplemental measure of the results of operations of its principal business activity by excluding items that are not reflective of such operations.  Adjusted earnings, adjusted earnings per share, segment operating profit, and net debt may be useful to investors in evaluating the underlying operating performance of the company’s business as these measures eliminate items that are not reflective of its principal business activity.", "Further, free cash flow relates to cash provided by continuing operating activities less additions to property, plant and equipment.  Management has historically used free cash flow to evaluate its period-over-period cash generation performance because it believes this has provided a useful supplemental measure related to its principal business activity.  Free cash flow may be useful to investors to assist in understanding the comparability of cash flows generated by the company’s principal business activity.  It should not be inferred that the entire free cash flow amount is available for discretionary expenditures, since the company has mandatory debt service requirements and other non-discretionary expenditures that are not deducted from the measure.  Management uses non-GAAP information principally for internal reporting, forecasting, budgeting and calculating compensation payments.", "The company routinely posts important information on its website – ", "www.o-i.com/investors", ".", "Forward-Looking Statements", "This press release contains “forward-looking” statements related to O-I Glass, Inc. (“O-I Glass” or the “company”) within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”) and Section 27A of the Securities Act of 1933. Forward-looking statements reflect the company’s current expectations and projections about future events at the time, and thus involve uncertainty and risk. The words “believe,” “expect,” “anticipate,” “will,” “could,” “would,” “should,” “may,” “plan,” “estimate,” “intend,” “predict,” “potential,” “continue,” and the negatives of these words and other similar expressions generally identify forward-looking statements.", "It is possible that the company’s future financial performance may differ from expectations due to a variety of factors including, but not limited to the following: (1) the company’s ability to obtain the benefits it anticipates from the Corporate Modernization, (2) risks inherent in, and potentially adverse developments related to, the Chapter 11 bankruptcy proceeding involving Paddock, that could adversely affect the company and the company’s liquidity or results of operations, including the impact of deconsolidating Paddock from the company’s financials, risks from asbestos-related claimant representatives asserting claims against the company and potential for litigation and payment demands against us by such representatives and other third parties, (3) the amount that will be necessary to fully and finally resolve all of Paddock’s asbestos-related claims and the company’s obligations to make payments to resolve such claims under the terms of its support agreement with Paddock, (4) the company’s ability to manage its cost structure, including its success in implementing restructuring or other plans aimed at improving the company’s operating efficiency and working capital management, achieving cost savings, and remaining well-positioned to address the company’s legacy liabilities, (5) the company’s ability to acquire or divest businesses, acquire and expand plants, integrate operations of acquired businesses and achieve expected benefits from acquisitions, divestitures or expansions, (6) the company’s ability to achieve its strategic plan, (7) foreign currency fluctuations relative to the U.S. dollar, (8) changes in capital availability or cost, including interest rate fluctuations and the ability of the company to refinance debt at favorable terms, (9) the general political, economic and competitive conditions in markets and countries where the company has operations, including uncertainties related to Brexit, economic and social conditions, disruptions in the supply chain, competitive pricing pressures, inflation or deflation, changes in tax rates and laws, natural disasters and weather, (10) the impact of COVID-19 and the various governmental, industry and consumer actions related thereto, (11) the company’s ability to generate sufficient future cash flows to ensure the company’s goodwill is not impaired, (12) consumer preferences for alternative forms of packaging, (13) cost and availability of raw materials, labor, energy and transportation, (14) consolidation among competitors and customers, (15) unanticipated expenditures with respect to data privacy, environmental, safety and health laws, (16) unanticipated operational disruptions, including higher capital spending, (17) the company’s ability to further develop its sales, marketing and product development capabilities, (18) the failure of the company’s joint venture partners to meet their obligations or commit additional capital to the joint venture, (19) the ability of the company and the third parties on which it relies for information technology system support to prevent and detect security breaches related to cybersecurity and data privacy, (20) changes in U.S. trade policies, and the other risk factors discussed in the company’s Annual Report on Form 10-K for the year ended December 31, 2019 and any subsequently filed Annual Report on Form 10-K, Quarterly Reports on Form 10-Q or the company’s other filings with the Securities and Exchange Commission.", "It is not possible to foresee or identify all such factors.  Any forward-looking statements in this document are based on certain assumptions and analyses made by the company in light of its experience and perception of historical trends, current conditions, expected future developments, and other factors it believes are appropriate in the circumstances.  Forward-looking statements are not a guarantee of future performance and actual results or developments may differ materially from expectations.  While the company continually reviews trends and uncertainties affecting the company’s results or operations and financial condition, the company does not assume any obligation to update or supplement any particular forward-looking statements contained in this document.", "1", " Adjusted earnings per share, free cash flow and segment operating profit are each non-GAAP financial measures. See tables included in this release for reconciliations to the most directly comparable GAAP measures.", "2", " Net Debt is defined as Total Debt less Cash. See tables included in this release for reconciliations to the most directly comparable GAAP measures.", " ", " ", "\n    ", "Attachments", "\n"], "tickers": []}
]